[
  {
    "img": "./image/image_dashboard.jpeg",
    "title": "Admin Dashboard",
    "category": "web",
    "description": "A powerful and responsive Admin Dashboard built using the MVC architecture in Laravel. It includes user, product, and order management, as well as analytics visualized with interactive charts. Features include authentication, CRUD operations, real-time statistics, and clean UI components styled with Tailwind CSS. Designed to demonstrate full-stack development using PHP Laravel and Blade templating.",
    "lang": ["php", "laravel", "mysql", "tailwind", "blade"],
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "img": "./image/online_bulid_image.jpeg",
    "title": "Ecommerce Website",
    "category": "web",
    "description": "A fully responsive online store built with HTML, CSS, and JavaScript. It features a product catalog, interactive UI, add-to-cart functionality, and smooth user experience across devices. Designed with modern layouts and animations to enhance shopping engagement.",
    "lang": ["html", "css", "js"],
    "links": {
      "view": "https://bulid-online-store.netlify.app",
      "code": "https://github.com/mohamed-wafik/Ecommerce-Website"
    }
  },
  {
    "img": "./image/full-stack-ecommerce-9ms2.vercel.app.jpeg",
    "title": "Full-Stack Website",
    "category": "web",
    "description": "A complete full-stack web application built with Next.js (App Router), Shadcn UI, Tailwind CSS, Prisma, MongoDB, and JWT authentication. The platform provides both a client-facing website for browsing products, authentication, and orders, and an admin dashboard for managing products, users, and analytics. It includes secure role-based access, responsive UI, and modern design for both client and admin sides.",
    "lang": [
      "nextjs",
      "typescript",
      "tailwind",
      "shadcn",
      "prisma",
      "mongodb",
      "jwt"
    ],
    "links": {
      "view": "https://full-stack-ecommerce-9ms2.vercel.app/",
      "code": "#"
    }
  },
  {
    "img": "./image/chat-app.jpeg",
    "title": "Chat App",
    "category": "web",
    "description": "A modern real-time chat application built with React, TailwindCSS, DaisyUI, Node.js, Express, MongoDB, and Socket.io. It features secure user authentication with JWT, real-time messaging, online status tracking, and clean UI using DaisyUI components. This project demonstrates full-stack development skills with a focus on scalability, responsive design, and real-time communication.",
    "lang": [
      "react",
      "tailwind",
      "daisyui",
      "nodejs",
      "express",
      "mongodb",
      "socket.io",
      "jwt"
    ],
    "links": {
      "view": "#",
      "code": "https://github.com/mohamed-wafik/chat-app"
    }
  },
  {
    "img": "./image/image-to-do-website.jpeg",
    "title": "To-Do List",
    "category": "web",
    "description": "A minimal and functional To-Do List web application developed using HTML, CSS, and JavaScript. It allows users to add, mark as complete, and delete tasks seamlessly. Designed with a clean UI and responsive layout, it’s perfect for improving productivity and practicing dynamic front-end development.",
    "lang": ["html", "css", "js"],
    "links": {
      "view": "https://cosmic-rugelach-968c38.netlify.app",
      "code": "https://github.com/mohamed-wafik/To-Do-List"
    }
  },
  {
    "img": "./image/image-portfolio-theme-new.jpeg",
    "title": "Profile",
    "category": "web",
    "description": "A personal profile webpage built with HTML, CSS, and JavaScript. It includes a responsive layout, smooth animations, and interactive sections like About Me, Skills, and Contact. Designed to highlight personal information in a modern and user-friendly way.",
    "lang": ["html", "css", "js"],
    "links": {
      "view": "#",
      "code": "https://github.com/mohamed-wafik/profile"
    }
  },
  {
    "img": "./image/image-template-one.jpeg",
    "title": "Template One",
    "category": "web",
    "description": "The first professional website template built during the Elzero Web School course. Fully responsive and developed with HTML and CSS, it demonstrates layout structuring, typography, responsive grids, and reusable components. Ideal for practicing semantic HTML and modern CSS techniques.",
    "lang": ["html", "css"],
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "img": "./image/image-template-two.jpeg",
    "title": "Template Two",
    "category": "web",
    "description": "A clean and responsive website template built as part of the Elzero Web School course. Developed using only HTML and CSS, it showcases layout structuring, responsive design, and elegant UI elements. Ideal for practicing front-end skills and building modern static websites.",
    "lang": ["html", "css"],
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "img": "./image/image-template-three.jpeg.jpeg",
    "title": "Template Three",
    "category": "web",
    "description": "A modern and feature-rich website template developed in the Elzero Web School course. Built with pure HTML and CSS, it showcases advanced responsive layouts, creative sections, and clean styling that can be adapted into real-world projects or portfolios.",
    "lang": ["html", "css"],
    "links": {
      "view": "#",
      "code": "#"
    }
  }
]
